# quantum-computer

## Описание
Квантовый компьютер. Реализация квантовых операций:
- вычисление кронекеровских произведений матриц и векторов
(task1) itmo1.py
- применение операторов эволюции к квантовым системам и последующее измерение состояний
(task2) itmo2.py

## Этап 1
Реализация вычислителя кронекеровских произведений.

1. Входные данные. 
На первой строке будет слово «matrix» или «vector», обозначающее соответственно кронекеровское произведение матриц или векторов. На второй строке будет два целых положительных числа n, m разделенных пробелом. n · m ≤ 108 в случае векторов и n · m ≤ 104 в случае матриц. Далее в случае векторов на третьей и четвертой строке будут располагаться n и m действительных чисел через пробел. В случае матриц на следующих n строчках располагается по n чисел разделенных пробелами. После чего на следующих m строчках располагается по m чисел разделенных пробелами
2. Выходные данные.
Выходными данными для этой задачи в случае векторов является n·m действительных чисел, разделенные одним пробелом.
В случае матриц выходными данными являются n · m строк на каждой из которых по n · m действительных чисел, разделенных пробелами. 
Решение
Язык программирования: Python 3.8
Определяем функцию kronecker_vec(), которая будет вычислять кронекеровское произведение двух векторов.

        def kronecker_vec(vec1, vec2):
            vec_new = []
            for i in vec1:
                for j in vec2:
                    vec_new += [i * j]
            return vec_new

Функция kronecker_matrix() будет вычислять кронекеровское произведение двух матриц.

    def kronecker_matrix(matrix1, matrix2):

        global n, m
        matrix_new = [[0] * (n * m) for i in range(n * m)]
        for i1 in range(n):
            for j1 in range(n):
                for j2 in range(m):
                    for i2 in range(m):
                        matrix_new[i2 + i1 * m][j2 + j1 * m] = matrix1[i1][j1] * matrix2[i2][j2]
        return matrix_new

На вход подается слово. В зависимости от значения этого слова в дальнейшем принимаем на входе либо векторы, либо матрицы.

    first_str = input()

В случае с вектором применяем функцию kronecker_vec()

    if first_str == 'vector':
        n, m = (int(i) for i in input().split())

        vec1 = [int(i) for i in input().split()]
        vec2 = [int(i) for i in input().split()]

        vec_new = kronecker_vec(vec1, vec2)
Выводим полученный вектор

    for i in range(len(vec_new)):
        if i != n * m - 1:
            print(vec_new[i], end=' ')
        else:
            print(vec_new[i])

В случае с матрицами работаем с двумя матрицами и применяем функцию kronecker_matrix()

    else:
        n, m = (int(i) for i in input().split())
        matrix1 = [[0]*n for i in range(n)]
        matrix2 = [[0]*m for i in range(m)]

        for i in range(n):
            matrix1[i] = [int(j) for j in input().split()]
        for i in range(m):
            matrix2[i] = [int(j) for j in input().split()]


        matrix_new = kronecker_matrix(matrix1, matrix2)
    
Выводим полученную матрицу m*n

    for i in range(len(matrix_new)):
        for j in range(len(matrix_new)):
            if j != n * m - 1:
                print(matrix_new[i][j], end=' ')
            else:
                print(matrix_new[i][j])

## Этап 2
Реализация применения операторов эволюции (матриц) к квантовым системам (векторам) и последующее измерение состояний.

1. Входные данные. Первой строкой будет подаваться целое число кубит системы k такое, что 2 ≤ k ≤ 7 и маска измерения — строка длиной k состоящей из нулей и единиц. Маска и число кубит разделены пробелом. Во второй строке будет находиться 2 k действительных чисел. Эти числа обозначают состояние системы. Далее в последующих 2 k строк будут находиться 2 k действительных чисел разделенных пробелами. Эти числа соответствуют оператору эволюции системы.
2. Выходные данные. Выходными данными должен быть на первой строке вектор из 2 k чисел, соответствующий состоянию системы после применения на него оператора эволюции. На второй строке должен быть вектор из 2 k−p действительных чисел, где p — число нулей в маске, соответствующий состоянию системы после измерения кубитов с номерами индексов нулей в маске
Решение

Определим функцию apply_evolution(), которая будет применять оператор эволюции

    def apply_evolution(k, operator, state):
        state_new = [0 for i in range(2 ** k)]

        for j in range(2**k):
            for i in range(2**k):
                state_new[j] += operator[i][j] * state[j]
        return state_new

Сначала считываем количество бит и маску

    a, b = input().split()
    k = int(a)

Далее получаем состояние системы и оператор эволюции

    state = [float(i) for i in input().split()]
    operator = [[0]* (2** k) for i in range(2** k)]

    for i in range(2** k):
        operator[i] = [int(j) for j in input().split()]

Применяем функцию apply_evolution() к системе

    state_new = apply_evolution(k, operator, state)
    for i in range(len(state_new)):
        if i != 2** k - 1:
            print(state_new[i], end=' ')
        else:
            print(state_new[i])
        
Далее необходимо работать с маской. Определяем количество нулей в маске. Находим длину искомого вектора, она равна 2^(k-p), p – число нулей

    maska = [int(i) for i in b]
    p = maska.count(0)
    vector = [0 for i in range(2**(k-p))]

    print(p, vector)

